sbin/mknod/mknod.8
.\"     BSDI    mknod.8,v 2.1 1995/02/03 07:21:44 polk Exp
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mknod.8	8.2 (Berkeley) 12/11/93
.\"
.Dd November 11, 1994
.Dt MKNOD 8
.Os BSD 4
.Sh NAME
.Nm mknod
.Nd build special file
.Sh SYNOPSIS
.Nm mknod
.Ar name
.Op Cm c | Cm b
.Ar major minor
.br
.Nm mknod
.Ar name
.Op Cm c | Cm b
.Ar major unit subunit
.Sh DESCRIPTION
The
.Nm mknod
command creates device special files.
Normally the shell script
.Pa /dev/MAKEDEV
is used to create special files for commonly known devices; it executes
.Nm mknod
with the appropriate arguments and can make all the files required for the
device.
.Pp
To make nodes manually, the required arguments are:
.Pp
.Bl -tag -width majorx
.It Ar name
Device name, for example
.Dq sd
for a SCSI disk or
.Dq pty
for pseudo-tty devices.
.It Cm b | Cm c
Type of device. If the
device is a block type device such as a tape or disk drive which needs
both cooked and raw special files,
the type is
.Cm b .
All other devices are character type devices, such as terminal
and pseudo devices, and are type
.Cm c .
.It Ar major
The major device number is an integer number which tells the kernel
which device driver entry point to use.  To learn what
major device number to use for a particular device, check the file
.Pa /dev/MAKEDEV
to see if the device is known, or check
the system dependent device configuration file:
.Bd -filled -offset indent
.Do Pa /usr/src/sys/ Ns Em architecture Ns
.Pa /conf/ioconf.c. Ns Em architecture Ns
.Dc
.Ed
.Pp
(for example
.Pa /usr/src/sys/i386/conf/ioconf.c.i386 ) .
.It Ar minor
The minor device number tells the kernel which unit and/or subunit
the node corresponds to on the device.
It may be further subdivided into a
.Ar unit
and
.Ar subunit .
For example, there might be a single
.Ar minor
value specifying a tty line, or the
.Ar unit
might specify a disk unit number (a single drive) with the
.Ar subunit
being a partition on that drive.
.El
.Pp
The numeric parameters are specified using C syntax:
a leading
.Ql 0x
indicates that the parameter is hexadecimal,
a leading
.Ql 0
indicates an octal parameter,
and otherwise the parameter is treated as decimal.
.Sh SEE ALSO
.Xr mknod 2 ,
.Xr MAKEDEV 8
.Sh HISTORY
A
.Nm
command appeared in Version 6 AT&T UNIX.
The separate unit and subunit appeared in BSD/OS 2.0.
