libexec/getty/gettytab.5
.\"	BSDI gettytab.5,v 2.1 1995/02/03 06:45:22 polk Exp
.\"
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)gettytab.5	8.4 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt GETTYTAB 5
.Os BSD 4.2
.Sh NAME
.Nm gettytab
.Nd terminal configuration data base
.Sh SYNOPSIS
.Nm gettytab
.Sh DESCRIPTION
The
.Nm gettytab
file
is a simplified version of the
.Xr termcap 5
data base
used to describe terminal lines.
The initial terminal login process
.Xr getty 8
accesses the
.Nm gettytab
file each time it starts, allowing simpler
reconfiguration of terminal characteristics.
Each entry in the data base
is used to describe one class of terminals.
.Pp
There is a default terminal class,
.Em default ,
that is used to set global defaults for all other classes.
(That is, the
.Em default
entry is read, then the entry for the class required
is used to override particular settings.)
.Sh CAPABILITIES
Refer to
.Xr termcap 5
for a description of the file layout.
The
.Em default
column below lists defaults obtained if there is
no entry in the table obtained, nor one in the special
.Em default
table.
.Bl -column Name Type /usr/bin/login
.It Sy Name	Type	Default	Description
.It "ap	bool	false	set 7-bits and ignore input parity"
.It "bi	bool	false	bidirectional line (dial-in, dial-out)"
.It "bk	str	0377	alternate end of line character (input break)"
.It "ce	bool	false	use crt erase algorithm"
.It "ck	bool	false	use crt kill algorithm"
.It "cl	str" Ta Dv NULL Ta No "screen clear sequence"
.It "co	bool	false	console - add"
.Ql \en
after login prompt
.It "de	num	unused	delay before first banner"
.It "ds	str" Ta So Li ^Y Sc Ta
.No "delayed suspend character"
.It "dx	bool	false	set"
.Dv DECCTLQ
.It "ec	bool	false	leave echo"
.Tn OFF
.It "ep	bool	false	terminal uses even parity, 7-bits"
.It "er	str" Ta So Li ^? Sc Ta
.No "erase character"
.It "et	str" Ta So Li ^D Sc Ta
.No "end of text"
.Pq Dv EOF
character
.It "ev	str" Ta Dv NULL Ta No "initial environment"
.It "fl	str" Ta So Li ^O Sc Ta
.No "output flush character"
.It "hc	bool	false	do"
.Tn NOT
hangup line on last close
.It "he	str" Ta Dv NULL Ta No "hostname editing string"
.It "hf	bool	false	enable bidirectional hardware flow control"
.It "hn	str	hostname	hostname"
.It "ht	bool	false	terminal has real tabs"
.It "hw	bool	false	hardwired (ignore hardware carrier-detect)"
.It "ig	bool	false	ignore garbage characters in login name"
.It "im	str" Ta Dv NULL Ta
.No "initial (banner) message"
.It "in	str" Ta So Li ^C Sc Ta
.No "interrupt character"
.It "is	num	unused	input speed"
.It "kl	str" Ta So Li ^U Sc Ta
.No "kill character"
.It "lm	str	login:	login prompt"
.It "ln	str" Ta So Li ^V Sc Ta
.No "``literal next'' character"
.It "lo	str" Ta Pa /usr/bin/login Ta
.No "program to exec when name obtained"
.It "m0	str" Ta Dv NULL Ta
.No "stty-style mode string used to write messages"
.It "m1	str" Ta Dv NULL Ta
.No "stty-style mode string used to read login name"
.It "m2	str" Ta Dv NULL Ta
.No "stty-style mode string used to leave terminal as"
.It "ms	str" Ta Dv NULL Ta
.No "stty-style mode string for default modes"
.It "nl	bool	false	terminal has (or might have) a newline character"
.It "np	bool	false	set 8-bit, no parity"
.It "nx	str	default	next table (for auto speed selection)"
.It "op	bool	false	terminal uses odd parity"
.It "os	num	unused	output speed"
.It "pc	str" Ta So Li \e0 Sc Ta
.No "pad character (not currently used)"
.It "pe	bool	false	use printer (hard copy) erase algorithm"
.It "pf	num	0	delay"
between first prompt and following flush (seconds)
.It "ps	bool	false	line connected to a"
.Tn MICOM
port selector
.It "qu	str" Ta So Li \&^\e Sc Ta
.No "quit character"
.It "rp	str" Ta So Li ^R Sc Ta
.No "line retype character"
.It "rw	bool	false	do"
.Tn NOT
use raw for input, use cbreak
.It "sp	num	unused	line speed (input and output)"
.It "su	str" Ta So Li ^Z Sc Ta
.No "suspend character"
.It "tc	str	none	table continuation"
.It "to	num	0	timeout (seconds)"
.It "tt	str" Ta Dv NULL Ta
.No "terminal type (for environment)"
.It "ub	bool	false	do unbuffered output (of prompts etc)"
.It "we	str" Ta So Li ^W Sc Ta
.No "word erase character"
.It "xc	bool	false	do
.Tn NOT
echo control chars as
.Ql ^X
.It "xf	str" Ta So Li ^S Sc Ta Dv XOFF
(stop output) character
.It "xn	str" Ta So Li ^Q Sc Ta Dv XON
(start output) character
.El
.Pp
If no line speed is specified, speed will not be altered
from that which prevails when getty is entered.
Specifying an input or output speed will override
line speed for stated direction only.
.Pp
Terminal modes to be used for the output of the message,
for input of the login name,
and to leave the terminal set as upon completion,
are derived from the boolean flags specified and the
.Em \&ms
string.
If the derivation should prove inadequate,
any (or all) of these three may be overridden
with one of the
.Em \&m0 ,
.Em \&m1 ,
or
.Em \&m2
string specifications, which can be used to specify the
.Xr stty 1 \&-style
strings.
.Pp
Should
.Xr getty
receive a null character
(presumed to indicate a line break)
it will restart using the table indicated by the
.Em nx
entry. If there is none, it will re-use its original table.
.Pp
If the
.Em \&bi
flag is set,
.Xr getty
will enable bidirectional use on the line.
The line must support modem control, thus this option is incompatible
with the
.Em \&hw
flag.
In this mode,
.Xr getty
waits for carrier detect, then checks whether the line is locked for dial-out
use.
If it is locked, it pauses until the line is unlocked.
If the line is not locked,
.Xr getty
acquires the lock to prevent dial-out use until the line is hung up.
.Pp
The
.Em \&cl
screen clear string may be preceded by a (decimal) number
of milliseconds of delay required (a la termcap).
.Pp
The initial message, and login message,
.Em \&im
and
.Em \&lm
may include the character sequence
.Em \&%h
or
.Em \&%t
to obtain
the hostname or tty name respectively.
.Pf ( Em %%
obtains a single '%' character.)
The hostname is normally obtained from the system,
but may be set by the
.Em \&hn
table entry.
In either case it may be edited with
.Em \&he .
The
.Em \&he
string is a sequence of characters, each character that
is neither '@' nor '#' is copied into the final hostname.
A '@' in the
.Em \&he
string, causes one character from the real hostname to
be copied to the final hostname.
A '#' in the
.Em \&he
string, causes the next character of the real hostname
to be skipped.
Surplus '@' and '#' characters are ignored.
.Pp
When getty execs the login process, given
in the
.Em \&lo
string (usually
.Dq Pa /usr/bin/login ) ,
it will have set
the environment to include the terminal type, as indicated
by the
.Em \&tt
string (if it exists).
The
.Em \&ev
string, can be used to enter additional data into
the environment.
It is a list of comma separated strings, each of which
will presumably be of the form
.Em name=value .
.Pp
If a non-zero timeout is specified, with
.Em \&to ,
then getty will exit within the indicated
number of seconds, either having
received a login name and passed control
to
.Xr login ,
or having received an alarm signal, and exited.
This may be useful to hangup dial in lines.
.Pp
The terminal settings are no longer reset to system defaults
before invoking
.Xr login 1 .
You are now allowed to override them in the gettytab entry.
.Pp
.Nm Getty
inherits its settings (including parity and character size)
from the system defaults (set with the
.Ar \&-D
option to
.Xr stty 1 ) .
.Pp
Even parity may be specified with
.Em \&ep
or odd parity with
.Em \&op .
The
.Em \&ap
option disables input parity checking (and may be used in
conjunction with
.Em \&ep
or
.Em \&op ) .
.Em \&np
sets 8-bit characters with no parity.
.Sh SEE ALSO
.Xr login 1 ,
.Xr termcap 5 ,
.Xr getty 8 .
.Sh BUGS
In
.Em all
cases, '#' or '^H' typed in a login name will be treated as
an erase character, and '@' will be treated as a kill character.
.Pp
The
.Em \&he
capability is stupid.
.Pp
The
.Xr termcap
format is horrid, something more rational should
have been chosen.
.Sh HISTORY
The
.Nm gettytab
file format appeared in 4.2BSD.
